import React, { useState } from "react";
import {
  Card,
  CardActionArea,
  CardContent,
  CardMedia,
  Typography,
  Dialog,
  DialogTitle,
  DialogContent,
} from "@mui/material";
import CloseIcon from "@mui/icons-material/Close";
import IconButton from "@mui/material/IconButton";

interface CardData {
  title: string;
  image: string;
  description: string[];
}

const cardData: CardData[] = [
  {
    title: "፬ የትምህርትና ሐዋሪያዊ አገልግሎት ክፍል",
    image: "https://via.placeholder.com/150",
    description: [
      `፩ በግቢ ጉባኤው የሚደረጉትን ማናቸውንም /መደበኛና መደበኛ ያልሆኑ/ የትምህርት
  መርሃ ግብራት ቀድሞ ለማዕከሉ መርሐ ግብራት ክትትል ንዑስ ክፍል ያቀርባል።
  በተጨማሪም በመርሓ ግብሮቹ ላይ ከማዕከሉ መርሐ ግብራት ክትትል ንዑስ ክፍል ጋር
  በመነጋገር መምህራን እንዲመደቡ ያደርጋል የተመደቡትንም መምህራን ሁኔታ
  በተመለከተ ከመርሐ ግብሩ/ከኮርሱ ፍጻሜ በኋላ ሪፖርት ለመርሐ ግብራት ክትትል ንዑስ
  ክፍል ያቀርባል፤`,
      `፪ በተነደፈው ስርዓተ ትምህርት መሰረት ለአባላት ተገቢው ትምህርት መሰጠቱንና መርሐ
  ግብሮች በተያዘላቸው ሰዓት መከናወናቸውን ይቆጣጠራል፤`,
      `፫ የግቢ ጉባኤው ተማሪዎች ለሰንበት ት/ቤት፣ ለአካባቢው ወጣቶች፣ ለአካባቢው አብያተ
  ክርስቲያናት፣ ለአካባቢው ገዳማት፣ ለአካባቢው ማህበረሰብ የተለያዩ አገልግሎቶችን
  ይሰጣል፤`,
      `፬ በግቢ ጉባኤው ውስጥ ተተኪ መምህራንና መርሃ ግብር መሪዋችን ለማፍራት ከማዕከሉ
  ጋር በመሆን ስልጠናዎችንም ሆነ ሰልጣኞችን ያስተባብራል፤`,
      `፭ የግቢ ጉባኤው አባላት በግቢ ውስጥ የሚሰጠውን የአብነት ትምህርት እንዲማሩ
  ይቀሰቅሳል፣ ለትምህርት የመጡትም ተገቢውን ትምህርት እንዲያገኙ ሁኔታዎችን
  ያመቻቻል፤`,
      `፮ የግቢ ጉባኤው የአብነት ትምህርት ቤት አስፈላጊውን አገልግሎት መስጠት እንዲችል
  የሚያስችሉ ግብዓቶች በሚጠበቀው ደረጃ እንዲሟሉ ያደርጋል፤የሀገር ውስጥ ግቢ ጉባኤያት የአገልግሎት መመሪያ፣ መዋቅር እና የአሠራር አቅጣጫዎች`,
      `፯ የአብነት ትምህርት ተምረው ለተመረቁት አገልግሎቱን እንዲለማመዱ ሁኔታዎችን
  ያመቻቻል፤`,
      `፰ ከምረቃ በኋላ ተጨማሪ የአብነት ትምህርት መማር ለሚፈልጉ ተማሪዎች ከማዕከሉ
  ገዳማትና አብነት ትምህርት ዋና ክፍል ጋር በመነጋገር ሁኔታዎችን ያመቻቻል፤`,
      `፱ ለአብነት ትምህርቱ አጋዥ የሆኑ ስልጠናዎች/ትምህርቶች እንዲሰጡ ያስተባብራል፤`,
      `፲ ለተመረጡ ተማሪዎች በክረምት ወቅት በሙሉ ጊዜ የአብነት ትምህርት እንዲማሩ
  ያስተባብራል፤`,
      `፲፩ አባላት ከመደበኛው ስርዓተ ትምህርት በተጨማሪ ለመንፈሳዊ ህይወታቸውና
  ለአገልግሎታቸው አጋዥ የሆኑ መርሃ ግብራትና የአገልግሎት ኮርስ እንዲያገኙ
  ሁኔታዎችን ያመቻቻል`,
    ],
  },
  {
    title: "የቋንቋዎችና ልዩ ፍላጎቶች አገልግሎት ማስተባበሪያ ክፍል",
    image: "https://via.placeholder.com/150",
    description: [
      `፩ በክፍሉ ውስጥ ያሉ አባላትን በመመደብ በተለያዩ ቋንቋዎች የሚሰጡ የግቢ ጉባኤው
    አገልግሎቶችን ከሚመለከታቸው የግቢ ጉባኤው ክፍሎች ጋር በመነጋገር መርሃ ግብሮችን
    ያስተባብራል፤`,
      `፪ በተለያዩ ቋንቋ የእንማር ጥያቄዎችን መረጃ በመሰብሰብ ከማዕከሉና ከግቢ ጉባኤው
    ሥራ አስፈጻሚ ጋር በመተባበር በየደረጃው አስፈላጊውን እገዛ ያደርጋል፤`,
      `፫ የልዩ ፍላጎት ድጋፍ(ለእህቶች፣ ለአካል ጉዳተኞች፣ ለሱሰኞች፣ ለአርክቴክቸርና ለስነ
    ልቦና ትምህርት ክፍል ተማሪዎች፣ ለቋንቋ፣ ለተሃድሶ፣ ወዘተ) የሚፈልጉ ተማሪዎችን
    የመለየት ስራ በመስራት፤ ወጥነት ባለው መልኩአስፈላጊውን ትምህርትና ድጋፍእንዲያገኙ
    ያደርጋል፤`,
      `፬ የልዩ ፍላጎት ትምህርትና ድጋፍ ለሚያስፈልጋቸው ለተለያዩ የግቢ ጉባኤው ተማሪዎች
    (ለእህቶች፣ ለአካል ጉዳተኞች፣ በሰ/ት/ቤት ቆይታ ላልነበራቸው፣ የግቢ ጉባኤውን መደበኛ
    ትምህርቶች በሌሎች ቦታዎች ተምረው ለሚመጡ፣ ከተለዩ ቦታና ባህል ለሚመጡ አባላት፣
    ግቢ ጉባኤው የሚሰጠውን አገልግሎት ለማግኘት የቋንቋ ተጽእኖ ላለባቸው፣ ሌሎችም
    የተለየ የድጋፍ ትምህርት ለሚያስፈልጋቸው) ተማሪዎችንየመለየት ስራ በመስራት፤
    ወጥነት ባለው መልኩአስፈላጊውን ትምህርትና ድጋፍእንዲያገኙ ያደርጋል፤የሀገር ውስጥ ግቢ ጉባኤያት የአገልግሎት መመሪያ፣ መዋቅር እና የአሠራር አቅጣጫዎች`,
      `፭ በግቢ ጉባኤው ውስጥ በትምህርት ላይ ለሚገኙ የገጠርና የከተማ ጤና ኤክስቴንሽን
    ሠራተኞች፣ የግብርና ልማት ሠራተኞች (Development Agents/DAs) እና የ1ኛ ደረጃ
    ት/ቤት መምህራንን ለቀጣይ ቤተ ክርስቲያን ተልዕኮ (የቤ/ክ አገልግሎት በሚፈለገው
    መጠን ያልደረሰባቸው ቦታዎችን ከመድረስ አንጻር) መሰረት ባደረገ መልኩ በተለየ ሁኔታ
    እንዲማሩ ሁኔታዎችን ያመቻቻል፤`,
      `፮ በአጠቃላይ ከቋንቋ እና ልዩ ፍላጎቶች ጋር በተገናኘ ያሉ ክፍተቶችን ይለያል፣ በዚህ
    ረገድ በተግዳሮት ውስጥ ያሉትን የግቢ ጉባኤ አባላት አጥንቶ መረጃቸውን ወደ
    ሚመለከታቸው የአገልግሎት ክፍሎች ያቀርባል፣ አገልግሎቶቹንም ለእነርሱ በሚሆን
    መልኩ ያመቻቻል፣ በአግባቡ አገልግሎቱን እያገኙ መሆናቸውንም ይከታተላል፡፡`,
    ],
  },
  {
    title: "የአባላት እንክብካቤ፣ ምክክርና አቅም ማጎልበቻ ክፍል",
    image: "https://via.placeholder.com/150",
    description: [
      `፩ የግቢ ጉባኤ አባላትን በአባትና እናት አደረጃጀት ክትትል፣
    እንክብካቤና ድጋፍ እንዲያገኙ ያደርጋል፤
    የሀገር ውስጥ ግቢ ጉባኤያት የአገልግሎት መመሪያ፣ መዋቅር 
    እና የአሠራር አቅጣጫዎች`,
      `፪ የግቢ ጉባኤውን አባላት ከመናፍቃን ቅሰጣ ለመጠበቅ 
    በግቢው የሚደረጉ የአጽራረ ቤተ ክርስቲያን እንቅስቃሴዎችን 
    መረጃ በባች የአባላት ጉዳይ ተወካዮች እንዲሁም በሌሎች 
    አባላት አማካኝነት ይሰበስባል፣ ይተነትናል፣ 
    ለስራ አስፈጻሚና ማዕከሉም ያሳውቃል፤`,
      `፫ የግቢ ጉባኤውን አባላት ገና ሲገቡ በትምህርት ክፍል፣ 
    በዓመት፣ በጾታ፣ ወዘተ በመመዝገብ (ሙሉ መረጃ ከነፎቶዎቻቸው) 
    ይይዛል፤ በየሩብ ዓመቱም ለማዕከሉ ግቢ ጉባኤያት 
    ማስተባበሪያ ዋና ክፍል ይልካል፤ የአባላትም መረጃ 
    አስፈላጊ ከሆነ ብቻ ከግቢ ጉባኤው ጽ/ቤት ጋር 
    በመነጋገር ለጠየቁ አካላት ይሰጣል፤`,
      `፬ በምረቃ መጽሔት ላይ የሚወጡ አባላትን ባለው መረጃ 
    መሰረት ከመስፈርቱ አንጻር ገምግሞ በስራ አስፈጻሚ 
    ጉባኤ ያጸድቃል፤ ፎቶዎቻቸውንና የመጽሔት ዝግጅት 
    ገንዘብንም ይሰበስባል፤ ሲጨርስም ለማዕከሉ/ወረዳ 
    ማዕከሉ ግቢ ጉባኤያት ማስተባበሪያ ዋና ክፍል 
    ይልካል፤`,
      `፭ የግቢ ጉባኤ ተማሪዎችን ለማብቃት በግቢ ጉባኤያት 
    ደረጃ የሚሰጡትን የተተኪ አመራርና ሌሎች 
    የማብቂያ ዘርፎች ላይ በመደበኝነት የሚሰለጥኑ 
    አባላትን መምረጥ፣ ስልጠና እንዲያገኙ ማድረግና 
    የተግባር ልምምድ እንዲያደርጉ ማስተባበር፤`,
      `፮  በየባቹ የባች አስተባባሪ ኮሚቴ የአባላት ጉዳይ 
    ተወካዮችና በአባላት እንክብካቤ አማካኝነት አባላት 
    የገጠማቸውን የቀለም ትምህርት፣ የመንፈሳዊና 
    ማህበራዊ ችግሮች በመሰብሰብ መፍትሄ የሚያገኙበትን 
    መንገድ ከማዕከሉ/ወረዳ ማዕከሉ አባላትና ወረዳ 
    ማዕከላት ማስተባበሪያ ክፍል ጋር በመሆን ያመቻቻል፤`,
      `፯ አባላት የንስሃ አባት እንዲይዙ ሁኔታዎችን 
    ያመቻቻል በተጨማሪም ሂደቱን ይከታተላል፤`,
      `፰ ግቢ ጉባኤው የምክክር አገልግሎት መስጫ ማዕከል 
    እንዲኖረው ይሰራል፤`,
      `፱ የግቢ ጉባኤውን የንስሃ አባቶች ቁጥር 
    ለመጨመርም ሆነ ለንስሃ አባቶች የውይይት መድረክ 
    ከሚመለከታቸውጋር በመሆን ያመቻቻል፤`,
      `፲ ከግቢ ጉባኤውም ሆነ ከማዕከሉ አባላት ውስጥ 
    የምክክር አገልግሎት መስጠት የሚችሉ 
    አባላትን መዝግቦ ይይዛል፣ የውይይትና የአቅም 
    ማሳደጊያ መድረኮችን ያዘጋጃል፤ 
    አባላትም አገልግሎቱን እንዲያገኙ ያስተባብራል`,
    ],
  },
  {
    title: "የመረጃ መሰብሰቢያና ማደራጃ ንዑስ ክፍል",
    image: "https://via.placeholder.com/150",
    description: [
      `፩ የግቢ ጉባኤ አባላትን በአባትና እናት አደረጃጀት ክትትል፣
    እንክብካቤና ድጋፍ እንዲያገኙ ያደርጋል፤
    የሀገር ውስጥ ግቢ ጉባኤያት የአገልግሎት መመሪያ፣ መዋቅር 
    እና የአሠራር አቅጣጫዎች`,
      `፪ የግቢ ጉባኤውን አባላት ከመናፍቃን ቅሰጣ ለመጠበቅ 
    በግቢው የሚደረጉ የአጽራረ ቤተ ክርስቲያን እንቅስቃሴዎችን 
    መረጃ በባች የአባላት ጉዳይ ተወካዮች እንዲሁም በሌሎች 
    አባላት አማካኝነት ይሰበስባል፣ ይተነትናል፣ 
    ለስራ አስፈጻሚና ማዕከሉም ያሳውቃል፤`,
    ],
  },
];

const Structures: React.FC = () => {
  const [open, setOpen] = useState(false);
  const [selectedCard, setSelectedCard] = useState<CardData | null>(null);

  const handleClickOpen = (card: CardData) => {
    setSelectedCard(card);
    setOpen(true);
  };

  const handleClose = () => {
    setOpen(false);
    setSelectedCard(null);
  };

  return (
    <div style={{ display: "flex", gap: "16px" }}>
      {cardData.map((card, index) => (
        <Card key={index} sx={{ maxWidth: 345, "&:hover": { boxShadow: 6 } }}>
          <CardActionArea onClick={() => handleClickOpen(card)}>
            <CardMedia
              component="img"
              height="140"
              image={card.image}
              alt={card.title}
            />
            <CardContent>
              <Typography gutterBottom variant="h5" component="div">
                {card.title}
              </Typography>
            </CardContent>
          </CardActionArea>
        </Card>
      ))}
      <Dialog
        sx={{ "& .MuiDialog-paper": { maxWidth: "850px" } }}
        open={open}
        onClose={handleClose}
      >
        <DialogTitle sx={{ fontWeight: "900", fontSize: "1.5rem" }}>
          {selectedCard?.title} አጠቃላይ ተግባራት እና ኃላፊነቶች
          <IconButton
            aria-label="close"
            onClick={handleClose}
            sx={(theme) => ({
              position: "absolute",
              right: 8,
              top: 8,
              color: theme.palette.grey[500],
            })}
          >
            <CloseIcon />
          </IconButton>
        </DialogTitle>
        <DialogContent>
          {selectedCard?.description.map((desc, index) => (
            <Typography key={index} paragraph>
              {desc}
            </Typography>
          ))}
        </DialogContent>
      </Dialog>
    </div>
  );
};

export default Structures;
